Biel-013/LoRaSX1276_STM32_Example/Core/Inc/LoRa_SX1276.h
/*
 *      Comunicaçao chip SX1276 LoRa via Uart - LoRa_SX1276.h
 *
 *      Data: 29 de agosto, 2023
 *      Autor: Gabriel Luiz
 *      Contato: (31) 97136-4334 || gabrielluiz.eletro@gmail.com
 */
/*
 * 		- Links Úteis -
 *
 */

#ifndef INC_LORA_SX1276_H_
#define INC_LORA_SX1276_H_

#include "stm32f1xx_hal.h"

#define AT_BEGINTERM "AT+"
#define AT_ENDTERM "<OK>\n\n"

typedef uint64_t LoRa_Id;

typedef uint8_t LoRa_Data;

typedef int8_t LoRa_RSSI;

typedef uint16_t LoRa_Value;

typedef unsigned char LoRa_Char;

typedef float LoRa_Float;

typedef uint32_t LoRa_Rate;

typedef uint32_t LoRa_Adress;

typedef struct {
	uint32_t LoRa_HighKey[2];
	uint32_t LoRa_LowKey[2];
} LoRa_KeyTypeDef;

typedef enum {
	LORA_FAILED = 0x00U,
	LORA_OK = 0x01U,
	LORA_FAILED_CHARACTER = 0x02U,
	LORA_FAILED_COMMAND = 0x03U,
	LORA_BUSY = 0x04U,
	LORA_TIMEOUT = 0x05U,
	LORA_CLEAR = 0x06U
} LoRa_StatusTypeDef;

typedef enum {
	LORA_PUBLIC_NETWORK_OFF = 0x00U, LORA_PUBLIC_NETWORK_ON = 0x01U
} LoRa_PublicNetworkTypeDef;

typedef enum {
	LORA_NETWORK_JOIN_MODE_ABP = 0x00U,
	LORA_NETWORK_JOIN_MODE_OTAA = 0x01U,
	LORA_NETWORK_JOIN_MODE_P2P = 0x02U
} LoRa_NetworkJoinModeTypeDef;

typedef enum {
	LORA_MAC_CLASS_A = 'A', LORA_MAC_CLASS_B = 'B', LORA_MAC_CLASS_C = 'C'
} LoRa_MacClassTypeDef;

typedef enum {
	LORA_NETWORK_NOT_JOINED = 0x00U, LORA_NETWORK_JOINED = 0x01U
} LoRa_NetworkJoinTypeDef;

typedef enum {
	LORA_AUTO_NETWORK_JOIN_ON = 0x00U, LORA_AUTO_NETWORK_JOIN_OFF = 0x01U
} LoRa_AutoNetworkJoinTypeDef;
typedef enum {
	LORA_AUTO_DATA_RATE_OFF = 0x00U, LORA_AUTO_DATA_RATE_ON = 0x01U
} LoRa_AutoDataRateTypeDef;

typedef enum {
	LORA_BATERY_LEVEL_USB = 0x00U,
	LORA_BATERY_LEVEL_MIN_LEVEL = 0x01U,
	LORA_BATERY_LEVEL_MAX_LEVEL = 0xFEU,
	LORA_BATERY_LEVEL_ERROR = 0xFFU
} LoRa_BateryLevelTypeDef;

typedef enum {
	LORA_READOUT_ENCRYPTION_AES = 0x00U, LORA_READOUT_ENCRYPTION_ARIA = 0x01U
} LoRa_ReadoutEncryptionTypeDef;

typedef enum {
	LORA_UPLINK_PACKET_TYPE_NOT_CONFIRMED = 0x00U,
	LORA_UPLINK_PACKET_TYPE_CONFIRMED = 0x01U
} LoRa_UplinkTypePacketTypeDef;

typedef enum {
	LORA_ECHO_OFF = 0x00U, LORA_ECHO_ON = 0x01U
} LoRa_LoraEchoTypeDef;

typedef enum {
	LORA_DEBUG_MESSAG_OFF = 0x00U, LORA_DEBUG_MESSAG_ON = 0x01U
} LoRa_DebugMessageTypeDef;

typedef enum {
	LORA_RF_STRENGHT_TEST_ERROR = 0x00U, LORA_RF_STRENGHT_TEST_DONE = 0x01U
} LoRa_StrenghtTestStatusTypeDef;

typedef enum {
	LORA_RF_STRENGHT_TEST_BAUND_125KHZ = 0x00U,
	LORA_RF_STRENGHT_TEST_BAUND_250KHZ = 0x01U,
	LORA_RF_STRENGHT_TEST_BAUND_500KHZ = 0x02U
} LoRa_StrenghtTestBaundTypeDef;

typedef enum {
	AT_OPERATION_READ = 0x00U,
	AT_OPERATION_WRITE = 0x01U,
	AT_OPERATION_ASYNCHRONOUS = 0x02U
} LoRa_OperationTypeDef;

typedef enum {
	LORA_CURRENT_DATA_RATE_SF12_BW125 = 0x00U,
	LORA_CURRENT_DATA_RATE_SF11_BW125 = 0x01U,
	LORA_CURRENT_DATA_RATE_SF10_BW125 = 0x02U,
	LORA_CURRENT_DATA_RATE_SF9_BW125 = 0x03U,
	LORA_CURRENT_DATA_RATE_SF8_BW125 = 0x04U,
	LORA_CURRENT_DATA_RATE_SF7_BW125 = 0x05U,
	LORA_CURRENT_DATA_RATE_SF7_BW250 = 0x06U,
	LORA_CURRENT_DATA_RATE_FSK = 0x07U
} LoRa_DataRateTypeDef;

typedef enum {
	LORAMAC_REGION_AS923 = 0x00U,
	LORAMAC_REGION_AU915 = 0x01U,
	LORAMAC_REGION_CN470 = 0x02U,
	LORAMAC_REGION_CN779 = 0x03U,
	LORAMAC_REGION_EU433 = 0x04U,
	LORAMAC_REGION_EU868 = 0x05U,
	LORAMAC_REGION_KR920 = 0x06U,
	LORAMAC_REGION_IN865 = 0x07U,
	LORAMAC_REGION_US915 = 0x08U,
	LORAMAC_REGION_US915_HYBRID = 0x09U
} LoRa_LoraMacRegionTypeDef;

typedef enum {
	AT_CHANNEL_OPERATION_CHANNEL = 0x00U,
	AT_CHANNEL_OPERATION_FREQ = 0x01U,
	AT_CHANNEL_OPERATION_DRRANGE = 0x02U,
	AT_CHANNEL_OPERATION_STATUS = 0x03U
} LoRa_ChannelOperationTypeDef;

typedef enum {
	AT_REBOOT_SYSTEM = 0x00U, AT_REBOOOT_CHANNEL = 0x01U
} LoRa_SystemRebootModeTypeDef;

typedef enum {
	AT_GPIO_MODE_INPUT = 'i',
	AT_GPIO_MODE_OUTPUT = 'o',
	AT_GPIO_SET_LOW = 0x00U,
	AT_GPIO_SET_HIGH = 0x01U,
	AT_GPIO_DEFAULT = 0x02U
} LoRa_PinConfigurationTypeDef;

typedef struct {
	LoRa_Id LoRa_EndDeviceIdentifier;
	LoRa_Id LoRa_AppEUIAdress;
	LoRa_KeyTypeDef LoRa_ApplicationKey;
	LoRa_PublicNetworkTypeDef LoRa_PublicNetwork;
	LoRa_NetworkJoinModeTypeDef LoRa_NetworkJoinMode;
	LoRa_MacClassTypeDef LoRa_MacClass;
	LoRa_NetworkJoinTypeDef LoRa_NetworkJoin;
	LoRa_Id *LoRa_NetworkIdentifier;
	LoRa_Adress *LoRa_DeviceAddress;
	LoRa_KeyTypeDef LoRa_NetworkSessionKey;
	LoRa_KeyTypeDef LoRa_ApplicationSessionKey;
	LoRa_AutoNetworkJoinTypeDef LoRa_AutoNetworkJoin;
} LoRa_ActivationSettingTypeDef;

typedef struct {
	LoRa_Value LoRa_Channel;
	LoRa_Rate LoRa_Frequency;
	LoRa_Value LoRa_MinDrRange;
	LoRa_Value LoRa_MaxDrRange;
	LoRa_Value LoRa_StatusChannel;
} LoRa_ChannelConfigurationTypeDef;

typedef struct {
	LoRa_Value LoRa_Dia;
	LoRa_Value LoRa_Mes;
	LoRa_Value LoRa_Ano;
} LoRa_DateTypeDef;

typedef struct {
	LoRa_Value LoRa_Horas;
	LoRa_Value LoRa_Minutos;
	LoRa_Float LoRa_Segundos;
} LoRa_TimeTypeDef;

typedef struct {
	LoRa_Char LoRa_PinChar;
	LoRa_Value LoRa_PinNumber;
	LoRa_PinConfigurationTypeDef LoRa_PinMode;
	LoRa_PinConfigurationTypeDef LoRa_PinState;
} LoRa_PinTypeDef;

typedef struct {
	LoRa_Float LoRa_FirmVersion;
	LoRa_LoraMacRegionTypeDef LoRa_Region;
	LoRa_DateTypeDef LoRa_Date;
	LoRa_TimeTypeDef LoRa_Time;
	LoRa_LoraEchoTypeDef LoRa_Echo;
	LoRa_Float LoRa_AntennaGain;
	LoRa_Value LoRa_AutoDataRate;
	LoRa_AutoDataRateTypeDef LoRa_DataRate;
	LoRa_Value LoRa_ConfirmedUplinkCount;
	LoRa_Value LoRa_UnConfirmedUplinkCount;
	LoRa_UplinkTypePacketTypeDef LoRa_UplinkMessageType;
	LoRa_Value LoRa_Alarm;
} LoRa_SystemInfoTypeDef;

typedef struct {
	LoRa_StrenghtTestStatusTypeDef LoRa_Status;
	LoRa_Value LoRa_DataSize;
	LoRa_RSSI LoRa_RSSI;
	LoRa_Value LoRa_SNR;
} LoRa_RxStrengthTestTypeDef;

typedef struct {
	LoRa_ChannelConfigurationTypeDef LoRa_Channels[16];
} LoRa_ChannelsTypeDef;

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- IDENTIDICADOR DO DISPOSITIVO FINAL --------------------------------------------------------------*/

/**
 * @brief Identificador de dispositivo final no espaço de endereço IEEE EUI64
 * @param _Operacao: Modo de operação do comando
 * @param _Identifier: Identificador de dispositivo final
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_EndDeviceIdentifier(LoRa_OperationTypeDef _Operacao,
		LoRa_Id *_Identifier);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- ID DE APLICATIVO GLOBAL -----------------------------------------------------------*/

/**
 * @brief ID de aplicativo global no espaço de endereço IEEE EUI64
 * @param _Operacao: Modo de operação do comando
 * @param _Identifier: ID de aplicativo global
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_AppEUIAdress(LoRa_OperationTypeDef _Operacao,
		LoRa_Id *_Identifier);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CHAVE DO DISPOSITIVO FINAL -----------------------------------------------------------*/

/**
 * @brief Chave de raiz AES-128 específica para o dispositivo final
 * @param _Operacao: Modo de operação do comando
 * @param _Keyword: Chave do dispositivo final
 * @retval Status de execução do comando
 */

