Biel-013/LoRaSX1276_STM32_Example/Core/Inc/LoRa_SX1276.h
/*---- VALOR DO RSSI DE LEITURA -----------------------------------------------------------*/

/**
 * @brief Valor RSSI de leitura dos últimos dados recebidos
 * @param  _Value: Valor do RSSI
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ReturnRSSI(LoRa_RSSI *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- VALOR DO SNR DE LEITURA -----------------------------------------------------------*/

/**
 * @brief Leitura do valor SNR (relação sinal-ruído) dos últimos dados recebidos
 * @param _Value: Valor do SNR
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ReturnsSNR(LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CONFIGURAÇÃO DA REGIÃO LORAMAC -----------------------------------------------------------*/

/**
 * @brief Retorna a configuração da região LoRaMAC. Reinicie após a atualização da configuração
 * @param _Operacao: Modo de operação do comando
 * @param _Region: Região de LoRaMAC
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_LoRaMacRegion(LoRa_OperationTypeDef _Operacao,
		LoRa_LoraMacRegionTypeDef *_Region);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TAXA DE DADOS AUTOMÁTICO -----------------------------------------------------------*/

/**
 * @brief Configuração de Auto Data Rate (ADR)
 * @param _Operacao: Modo de operação do comando
 * @param _Status: Status do ADR
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_AutoDateRate(LoRa_OperationTypeDef _Operacao,
		LoRa_AutoDataRateTypeDef *_Status);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CONFIGURAÇÃO DE TAXA DE DADOS -----------------------------------------------------------*/

/**
 * @brief Status da configuração da taxa de dados. O fator de espalhamento (SF) pode variar de acordo com a região
 * @param _Operacao: Modo de operação do comando
 * @param _DateRate: Taxa de dados
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_DataRateCommand(LoRa_OperationTypeDef _Operacao,
		LoRa_DataRateTypeDef *_DateRate);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- FREQUÊNCIA RX DA JANELA 2 -----------------------------------------------------------*/

/**
 * @brief Comando da frequência Rx da janela 2
 * @param _Operacao: Modo de operação do comando
 * @param _Rate: Frequência
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RxWindow2Frequency(LoRa_OperationTypeDef _Operacao,
		LoRa_Rate *_Rate);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TAXA DE DADOS RX DA JANELA 2 -----------------------------------------------------------*/

/**
 * @brief Comando da taxa de dados da janela Rx 2 (0-7 correspondente a DR_X)
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Taxa de dados
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RxWindow2DataRate(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- DELAY ENTRE JANELAS TX E RX1 -----------------------------------------------------------*/

/**
 * @brief Define o atraso entre o final da janela TX e a janela Rx 1 em ms
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Delay em ms
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_TxRxWindow1Delay(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- DELAY ENTRE JANELAS TX E RX2 -----------------------------------------------------------*/

/**
 * @brief Define o atraso entre o final do TX e a janela Rx 2 em ms
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Delay em ms
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_TxRxWindow2Delay(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- DELAY DE JUNÇÃO DA JANELA RX1 -----------------------------------------------------------*/

/**
 * @brief Comando para acessar o atraso de junção na janela RX 1 em ms
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Delay em ms
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_TxRxWindow1JoinDelay(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- DELAY DE ACEITAÇÃO DE JUNÇÃO DAS JANELAS TX E RX2 ------------------------------------------------*/

/**
 * @brief Defina o atraso de aceitação de junção entre o final do TX e a junção da janela Rx 2 em ms
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Delay em ms
 * @retval Status de execução do comando
 */

