Biel-013/LoRaSX1276_STM32_Example/Core/Inc/LoRa_SX1276.h
LoRa_StatusTypeDef AT_TxRxWindow2JoinDelay(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- REPETIÇÃO DE UPLINKS NÃO CONFIRMADOS -----------------------------------------------------------*/

/**
 * @brief Comando para repetir o uplink não confirmado sem aguardar o reconhecimento do servidor (1 - 15)
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Número de repetiçoes
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RepeatUnconfirmedUplink(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*----  -----------------------------------------------------------*/

/**
 * @brief Comando para reenvio de uplink confirmado. O envio se repete até que uma confirmação servidor chegue (1 - 8)
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Número de repetiçoes
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ResendConfirmedUplink(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- ÍNDICE DE POTÊNCIA TX -----------------------------------------------------------*/

/**
 * @brief Comando de Índice de Potência Tx
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Índice de Potência
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_TxPowerIndex(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CONTADOR DE UPLINKS -----------------------------------------------------------*/

/**
 * @brief Comando para acesso ao contador de uplinks (0 - 65535)
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Número de uplinks
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_UplinkCounter(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CONTADOR DE DOWNLINKS -----------------------------------------------------------*/

/**
 * @brief Comando para acesso ao contador de downlinks (0 - 65535)
 * @param _Operacao: Modo de operação do comando
 * @param _Value: Número de downlinks
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_DownlinkCounter(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Value);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- NÍVEL DE BATERIA DO DISPOSITIVO FINAL -----------------------------------------------------------*/

/**
 * @brief Este comando permite ao usuário acessar o nível da bateria do dispositivo final
 * @param _Operacao: Modo de operação do comando
 * @param _Level: Nível de bateria
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_BatteryLevel(LoRa_OperationTypeDef _Operacao,
		LoRa_BateryLevelTypeDef *_Level);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- VERIFICAÇÃO DE LINK -----------------------------------------------------------*/

/**
 * @brief Comando usado para verificar se o link está funcionando corretamente
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_MacLineCheckRequest(void);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CRIPTOGRAFIA DE LEITURA -----------------------------------------------------------*/

/**
 * @brief Configuração de criptografia de leitura
 * @param _Operacao: Modo de operação do comando
 * @param _Encryption: Modo de encriptação
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_EncryptionConfiguration(LoRa_OperationTypeDef _Operacao,
		LoRa_ReadoutEncryptionTypeDef *_Encryption);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- LEITURA E ATUALIZAÇÃO DE CONFIGURAÇÃO DE CANAL -----------------------------------------------------------*/

/**
 * @brief Comando para ler as configurações atuais do canal, e atualizar-las
 * @param _Operacao: Modo de operação do comando
 * @param _ChOperation: Configuração a ser lida ou modificada 
 * @param _hConfiguration: Handler de configurações do canal
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ChannelConfiguration(LoRa_OperationTypeDef _Operacao,
		LoRa_ChannelOperationTypeDef _ChOperation,
		LoRa_ChannelConfigurationTypeDef *_hConfiguration);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- REINICIALIZAÇÃO DO SISTEMA -----------------------------------------------------------*/

/**
 * @brief Comando de reinicialização do canal ou do sistema
 * @param _Mode: Modo de reinicialização
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_SystemReboot(LoRa_SystemRebootModeTypeDef _Mode);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

