Biel-013/LoRaSX1276_STM32_Example/Core/Inc/LoRa_SX1276.h
/*---- INFORMAÇÕES DO SISTEMA -----------------------------------------------------------*/

/**
 * @brief Comando para ler informações do sistema
 * @param _hInfo: Handler de informações do sistema
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_SystemInformation(LoRa_SystemInfoTypeDef *_hInfo);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- VERSÃO DO FIRMWARE -----------------------------------------------------------*/

/**
 * @brief Informações sobre a versão do firmware
 * @param _Version: Versão do firmaware
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_FirmwareVersion(LoRa_Float *_Version);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- GANHO DE ANTENA -----------------------------------------------------------*/

/**
 * @brief O comando para acesso ao ganho da antena (-4 e 6)
 * @param _Operacao: Modo de operação do comando
 * @param _Gain: Ganho de antena
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_AntennaGain(LoRa_OperationTypeDef _Operacao,
		LoRa_Float *_Gain);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TIPO DE PACOTE DE UPLINK -----------------------------------------------------------*/

/**
 * @brief Comando de leitura e definição de tipo de pacote uplink (0 ou 1)
 * @param _Operacao: Modo de operação do comando
 * @param _Type: Tipo de pacote
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_UplinkPacketType(LoRa_OperationTypeDef _Operacao,
		LoRa_UplinkTypePacketTypeDef *_Type);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- MODO DE BAIXO CONSUMO -----------------------------------------------------------*/

/**
 * @brief Comando para entrar no modo de baixo consumo (usar reset para voltar ao normal)
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_EntersLowPowerMode(void);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- ALARME DO RTC -----------------------------------------------------------*/

/**
 * @brief Hora de despertar do "real time clock" (RTC)
 * @param _Operacao: Modo de operação do comando
 * @param _Time: Tempo para despertar (em segundos)
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RTCWakeupTime(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Time);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- RELÓGIO DO RTC -----------------------------------------------------------*/

/**
 * @brief Comando de acessor ao relógio do "real time clock" (RTC)
 * @param _Operacao: Modo de operação do comando
 * @param _Time: Tempo do RTC
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RTCTime(LoRa_OperationTypeDef _Operacao,
		LoRa_TimeTypeDef *_Time);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- DATA DO RTC -----------------------------------------------------------*/

/**
 * @brief Comando de acessor a data do "real time clock" (RTC)
 * @param _Operacao: Modo de operação do comando
 * @param _Date: Data do RTC
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RTCDate(LoRa_OperationTypeDef _Operacao,
		LoRa_DateTypeDef *_Date);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- RETORNO DE ECO -----------------------------------------------------------*/

/**
 * @brief Comando de retorno de eco
 * @param _Operacao: Modo de operação do comando
 * @param _Echo: Retorno do eco
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ECHO(LoRa_OperationTypeDef _Operacao,
		LoRa_LoraEchoTypeDef *_Echo);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- REDEFINIÇÃO DE CONFIGURAÇÕES -----------------------------------------------------------*/

/**
 * @brief Comando para redefinir as configuração
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_ResetConfiguration(void);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- MODO DE DEBUG -----------------------------------------------------------*/

/**
 * @brief Comando para acesso ao modo de dubug
 * @param _Operacao: Modo de operação do comando
 * @param _Status: Status do modo debug
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_DebugMessageStatus(LoRa_OperationTypeDef _Operacao,
		LoRa_DebugMessageTypeDef *_Status);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TESTE DE FORÇA TX -----------------------------------------------------------*/

/**
 * @brief Modo de onda contínua FSK Tx (teste de força Tx)
 * @param _Frequency: Frequência de operação do teste
 * @param _Power: Potência de transmissão na operação do teste
 * @param _Timeout: Tempo total de teste (em segundos)
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_FSKTxContinuousWaveMode(LoRa_Rate _Frequency,
		LoRa_Value _Power, LoRa_Value _Timeout);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TESTE DE FORÇA DA ANTENA PARA RECEBIMENTO -----------------------------------------------------------*/

/**
 * @brief LoRa Rx (teste de força de RF)
 * @param _Frequency: Frequência de operação do teste
 * @param _DataRate: Configuração de taxa de dados do teste (0 - 7)
 * @param _TBaund: Largura de banda do teste (0 a 2)
 * @retval Status de execução do comando
 */

