Biel-013/LoRaSX1276_STM32_Example/Core/Inc/LoRa_SX1276.h
LoRa_StatusTypeDef AT_LoRaRxSignalStrengthTest(LoRa_Rate _Frequency,
		LoRa_Value _DataRate, LoRa_StrenghtTestBaundTypeDef _TBaund);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- TESTE DE FORÇA DA ANTENA PARA TRANSMISSÃO -----------------------------------------------------------*/

/**
 * @brief LoRa Tx (teste de força de RF)
 * @param _Frequency: Frequência de operação do teste
 * @param _Power: Potência de transmissão na operação do teste
 * @param _DataRate: Configuração de taxa de dados do teste (0 - 7)
 * @param _TBaund: Largura de banda do teste (0 a 3)
 * @param _NumberBytes: Número de bytes para transmissão
 * @param _Period: Periodo de transmissão dos bytes
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_LoRaTxSignalStrengthTest(LoRa_Rate _Frequency,
		LoRa_Value _Power, LoRa_Value _DataRate,
		LoRa_StrenghtTestBaundTypeDef _TBaund, LoRa_Value _NumberBytes,
		LoRa_Value _Period);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- FINALIZAÇÃO DE TESTE DE RF -----------------------------------------------------------*/

/**
 * @brief Comando para finalização de teste de RF
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_StopRFTest(void);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CONFIGURAÇÃO DE PINO GPIO -----------------------------------------------------------*/

/**
 * @brief Comando para acesso a configuração de pinos GPIO MS500
 * @param _Operacao: Modo de operação do comando
 * @param _GPIO: Pino GPIO para acesso
 * @param _Config: Configuração do pino GPIO
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_GPIOPinInformation(LoRa_OperationTypeDef _Operacao,
		LoRa_PinTypeDef *_GPIO, LoRa_PinConfigurationTypeDef _Config);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CANAL DE COMUNICAÇÃO P2P -----------------------------------------------------------*/

/**
 * @brief Comando para listar canais de comunicação diponíveis, e seleção de canal para comunicação P2P
 * @param _Operacao: Modo de operação do comando
 * @param _Channel: Canal de comunicação P2P
 * @param _ChannelsList: Lista de canais disponíveis
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_RegionalChannelListP2P(LoRa_OperationTypeDef _Operacao,
		LoRa_Value _Channel, LoRa_ChannelsTypeDef *_ChannelsList);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- ENDEREÇO DE COMUNICAÇÃO P2P -----------------------------------------------------------*/

/**
 * @brief  Defina o endereço do dispositivo P2P (4 bytes) para comunicação
 * @param _Operacao: Modo de operação do comando
 * @param _Adress: Endereço de comunicação P2P
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_DeviceAdressP2P(LoRa_OperationTypeDef _Operacao,
		LoRa_Adress *_Adress);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*---- CHAVE DE SINCRONIZAÇÃO -----------------------------------------------------------*/

/**
 * @brief Comando para definição de chave de sincronização
 * @param _Operacao: Modo de operação do comando
 * @param _Word: Chave de sincronização (1 a 255)
 * @retval Status de execução do comando
 */

LoRa_StatusTypeDef AT_SyncWordP2P(LoRa_OperationTypeDef _Operacao,
		LoRa_Value *_Word);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#endif /* INC_LORA_SX1276_H_ */
